#### Data frame - table

#### Series - row or column

In [1]:
import numpy as np
import pandas as pd

In [2]:
a = ['shubham', 'abhi', 'akash']

In [4]:
a = pd.DataFrame(a)

In [5]:
a

         0
0  shubham
1     abhi
2    akash

In [6]:
b = ['shubham', 'abhi', 'akash']

In [8]:
b = pd.DataFrame(b, index=["A", "B", "C"], columns=["students"])

In [9]:
b

  students
A  shubham
B     abhi
C    akash

In [12]:
type(b)

pandas.core.frame.DataFrame

In [11]:
type(b['students'])

pandas.core.series.Series

#### multiple series

In [13]:
names = ['shubham', 'abhi', 'akash']
marks = [50, 20, 60]

In [15]:
pd.DataFrame([names, marks] )

         0     1      2
0  shubham  abhi  akash
1       50    20     60

In [18]:
pd.DataFrame(names, marks )

          0
50  shubham
20     abhi
60    akash

In [19]:
# DataFrame(data=None, index: 'Axes | None' = None, columns: 'Axes | None' = None, dtype: 'Dtype | None' = None, copy: 'bool | None' = None) -> 'None'

In [29]:
row1 = ["shubham", 30, 'doctor', 90.4]
row2 = ["abhi", 26, 'cleaner', 45.4]
row3 = ["akash", 44, 'support', 88.2]

In [23]:
a = [row1, row2, row3]

In [24]:
b = np.array([row1, row2, row3])

In [25]:
a

[['shubham', 30, 'doctor', 90.4],
 ['abhi', 26, 'cleaner', 45.4],
 ['akash', 44, 'support', 88.2]]

In [26]:
b

array([['shubham', '30', 'doctor', '90.4'],
       ['abhi', '26', 'cleaner', '45.4'],
       ['akash', '44', 'support', '88.2']], dtype='<U32')

In [27]:
pd.DataFrame(a)

         0   1        2     3
0  shubham  30   doctor  90.4
1     abhi  26  cleaner  45.4
2    akash  44  support  88.2

In [28]:
pd.DataFrame(b)

         0   1        2     3
0  shubham  30   doctor  90.4
1     abhi  26  cleaner  45.4
2    akash  44  support  88.2

In [30]:
indexes = "A B C".split()

In [34]:
columns = "name age work weight".split()

In [36]:
df = pd.DataFrame(a, index= indexes, columns= columns)

In [37]:
df

      name  age     work  weight
A  shubham   30   doctor    90.4
B     abhi   26  cleaner    45.4
C    akash   44  support    88.2

#### putting data through dictionary

In [45]:
d = {
    1: ["shubham" , 20, 'netmax', 63.6, "np"],
    2: ["abhi" , 40, 'dev', 65.8, None],
    3: ["akash" , 50, 'data', 73.1, None]
    
}

In [46]:
pd.DataFrame(d)

         1     2      3
0  shubham  abhi  akash
1       20    40     50
2   netmax   dev   data
3     63.6  65.8   73.1
4       np  None   None

In [48]:
d = {
    "name": ["shubham" , "abhi", "akash"],
    "age": [20, 25, 30],
    "weight": [63.3, 52.0, 41.7]
    
}

In [53]:
df = pd.DataFrame(d, index=range(100, 103))

In [54]:
df

        name  age  weight
100  shubham   20    63.3
101     abhi   25    52.0
102    akash   30    41.7

#### Reading Files